# SQL for Analyst 5 - Subquery

In [1]:
# set MySQL URL
user = "dz3vg"
password = ""
host = "localhost"
port = 3306
dbname = "dataapplab_db"
with open("MySQL.key", "r") as file:
    password = file.read()
connection_string = f"mysql+mysqlconnector://{user}:{password}@{host}:{port}/{dbname}"

# connect to MySQL server
%load_ext sql
%sql $connection_string

# clean password
password = ""
connection_string = ""

In [2]:
%sql use hr

 * mysql+mysqlconnector://dz3vg:***@localhost:3306/dataapplab_db
0 rows affected.

[]

In [3]:
%%sql

select
    first_name, last_name
from
    employees
where
    department_id in (select
            department_id
        from
            departments
        where
            department_name like '%IT%')
limit 10
;

 * mysql+mysqlconnector://dz3vg:***@localhost:3306/dataapplab_db
5 rows affected.

[('Alexander', 'Hunold'),
 ('Bruce', 'Ernst'),
 ('David', 'Austin'),
 ('Valli', 'Pataballa'),
 ('Diana', 'Lorentz')]

In [4]:
%%sql

select
    first_name, last_name
from
    employees
where
    manager_id in (select
            employee_id
        from
            employees
        where
            department_id in (select
                    department_id
                from
                    departments
                where
                    location_id in (select
                            location_id
                        from
                            locations
                        where
                            country_id = 'US')))
limit 10
;

 * mysql+mysqlconnector://dz3vg:***@localhost:3306/dataapplab_db
10 rows affected.

[('Neena', 'Kochhar'),
 ('Lex', 'De Haan'),
 ('Alexander', 'Hunold'),
 ('Bruce', 'Ernst'),
 ('David', 'Austin'),
 ('Valli', 'Pataballa'),
 ('Diana', 'Lorentz'),
 ('Nancy', 'Greenberg'),
 ('Daniel', 'Faviet'),
 ('John', 'Chen')]

In [5]:
%%sql

select
    first_name, last_name, salary
from
    employees
where
    salary > all (select
            avg(salary)
        from
            employees
        group by department_id)
limit 10
;

 * mysql+mysqlconnector://dz3vg:***@localhost:3306/dataapplab_db
1 rows affected.

[('Steven', 'King', 24000)]

In [6]:
%%sql

select
    first_name, last_name, salary
from
    employees
where
    salary > any (select
            avg(salary)
        from
            employees
        group by department_id)
limit 10
;

 * mysql+mysqlconnector://dz3vg:***@localhost:3306/dataapplab_db
10 rows affected.

[('Steven', 'King', 24000),
 ('Neena', 'Kochhar', 17000),
 ('Lex', 'De Haan', 17000),
 ('Alexander', 'Hunold', 9000),
 ('Bruce', 'Ernst', 6000),
 ('David', 'Austin', 4800),
 ('Valli', 'Pataballa', 4800),
 ('Diana', 'Lorentz', 4200),
 ('Nancy', 'Greenberg', 12000),
 ('Daniel', 'Faviet', 9000)]

In [7]:
%%sql

select
    e.first_name, e.last_name, e.salary
from
    employees as e
        left join
    (select
        department_id, avg(salary) as avg_salary
    from
        employees 
    group by department_id) as avgd on e.department_id = avgd.department_id
where
    e.salary > avgd.avg_salary
limit 10
;

 * mysql+mysqlconnector://dz3vg:***@localhost:3306/dataapplab_db
10 rows affected.

[('Steven', 'King', 24000),
 ('Alexander', 'Hunold', 9000),
 ('Bruce', 'Ernst', 6000),
 ('Nancy', 'Greenberg', 12000),
 ('Daniel', 'Faviet', 9000),
 ('Den', 'Raphaely', 11000),
 ('Matthew', 'Weiss', 8000),
 ('Adam', 'Fripp', 8200),
 ('Payam', 'Kaufling', 7900),
 ('Shanta', 'Vollman', 6500)]

In [8]:
%%sql

select
    a.first_name, a.last_name
from
    employees as a
where
    not exists (select
            b.first_name, b.last_name
        from
            employees as b
        where
            b.manager_id = a.employee_id)
limit 10
;

 * mysql+mysqlconnector://dz3vg:***@localhost:3306/dataapplab_db
10 rows affected.

[('Bruce', 'Ernst'),
 ('David', 'Austin'),
 ('Valli', 'Pataballa'),
 ('Diana', 'Lorentz'),
 ('Daniel', 'Faviet'),
 ('John', 'Chen'),
 ('Ismael', 'Sciarra'),
 ('Jose Manuel', 'Urman'),
 ('Luis', 'Popp'),
 ('Alexander', 'Khoo')]

In [9]:
%%sql

select distinct
    salary, first_name, last_name
from
    employees
order by salary desc
limit 3
;

 * mysql+mysqlconnector://dz3vg:***@localhost:3306/dataapplab_db
3 rows affected.

[(24000, 'Steven', 'King'),
 (17000, 'Lex', 'De Haan'),
 (17000, 'Neena', 'Kochhar')]

In [10]:
%%sql

select
    t1.salary, t1.first_name, t1.last_name
from
    employees as t1
where
    (select
        count(distinct t2.salary)
    from
        employees as t2
    where
        t2.salary > t1.salary) < 3
;

 * mysql+mysqlconnector://dz3vg:***@localhost:3306/dataapplab_db
4 rows affected.

[(24000, 'Steven', 'King'),
 (17000, 'Neena', 'Kochhar'),
 (17000, 'Lex', 'De Haan'),
 (14000, 'John', 'Russell')]

In [11]:
%%sql

select
    *
from
    employees
where
    salary > 15000
    union
select
    *
from
    employees
where
    salary < 2500
limit 10
;

 * mysql+mysqlconnector://dz3vg:***@localhost:3306/dataapplab_db
8 rows affected.

[(100, 'Steven', 'King', 'SKING', '515.123.4567', datetime.date(1987, 6, 17), 'AD_PRES', 24000, Decimal('0.00'), 0, 90),
 (101, 'Neena', 'Kochhar', 'NKOCHHAR', '515.123.4568', datetime.date(1987, 6, 18), 'AD_VP', 17000, Decimal('0.00'), 100, 90),
 (102, 'Lex', 'De Haan', 'LDEHAAN', '515.123.4569', datetime.date(1987, 6, 19), 'AD_VP', 17000, Decimal('0.00'), 100, 90),
 (127, 'James', 'Landry', 'JLANDRY', '650.124.1334', datetime.date(1987, 7, 14), 'ST_CLERK', 2400, Decimal('0.00'), 120, 50),
 (128, 'Steven', 'Markle', 'SMARKLE', '650.124.1434', datetime.date(1987, 7, 15), 'ST_CLERK', 2200, Decimal('0.00'), 120, 50),
 (132, 'TJ', 'Olson', 'TJOLSON', '650.124.8234', datetime.date(1987, 7, 19), 'ST_CLERK', 2100, Decimal('0.00'), 121, 50),
 (135, 'Ki', 'Gee', 'KGEE', '650.127.1734', datetime.date(1987, 7, 22), 'ST_CLERK', 2400, Decimal('0.00'), 122, 50),
 (136, 'Hazel', 'Philtanker', 'HPHILTAN', '650.127.1634', datetime.date(1987, 7, 23), 'ST_CLERK', 2200, Decimal('0.00'), 122, 50)]

In [12]:
%%sql

select
    *
from
    employees
where
    salary > 15000
    union
select
    *
from
    employees
where
    salary > 15000
limit 10
;

 * mysql+mysqlconnector://dz3vg:***@localhost:3306/dataapplab_db
3 rows affected.

[(100, 'Steven', 'King', 'SKING', '515.123.4567', datetime.date(1987, 6, 17), 'AD_PRES', 24000, Decimal('0.00'), 0, 90),
 (101, 'Neena', 'Kochhar', 'NKOCHHAR', '515.123.4568', datetime.date(1987, 6, 18), 'AD_VP', 17000, Decimal('0.00'), 100, 90),
 (102, 'Lex', 'De Haan', 'LDEHAAN', '515.123.4569', datetime.date(1987, 6, 19), 'AD_VP', 17000, Decimal('0.00'), 100, 90)]

In [13]:
%%sql

select
    *
from
    employees
where
    salary > 15000
    union all
select
    *
from
    employees
where
    salary > 15000
limit 10
;

 * mysql+mysqlconnector://dz3vg:***@localhost:3306/dataapplab_db
6 rows affected.

[(100, 'Steven', 'King', 'SKING', '515.123.4567', datetime.date(1987, 6, 17), 'AD_PRES', 24000, Decimal('0.00'), 0, 90),
 (101, 'Neena', 'Kochhar', 'NKOCHHAR', '515.123.4568', datetime.date(1987, 6, 18), 'AD_VP', 17000, Decimal('0.00'), 100, 90),
 (102, 'Lex', 'De Haan', 'LDEHAAN', '515.123.4569', datetime.date(1987, 6, 19), 'AD_VP', 17000, Decimal('0.00'), 100, 90),
 (100, 'Steven', 'King', 'SKING', '515.123.4567', datetime.date(1987, 6, 17), 'AD_PRES', 24000, Decimal('0.00'), 0, 90),
 (101, 'Neena', 'Kochhar', 'NKOCHHAR', '515.123.4568', datetime.date(1987, 6, 18), 'AD_VP', 17000, Decimal('0.00'), 100, 90),
 (102, 'Lex', 'De Haan', 'LDEHAAN', '515.123.4569', datetime.date(1987, 6, 19), 'AD_VP', 17000, Decimal('0.00'), 100, 90)]